
&НаКлиенте
Процедура ЦенаБезНДСПриИзменении(Элемент)
	ПересчитатьЦенуСНДС();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ПересчитатьЦенуСНДС();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуСНДС() 
	
    Цена = Объект.ЦенаБезНДС;
    Ставка = Объект.СтавкаНДС;
    
    Если Цена = 0 Тогда
        Объект.ЦенаСНДС = 0;
        Возврат;
    КонецЕсли;

    
    Если Ставка = ПредопределенноеЗначение("Перечисление.СтавкаНДС.БезНДС") Тогда
        Объект.ЦенаСНДС = Цена;   
		
	ИначеЕсли Ставка = ПредопределенноеЗначение("Перечисление.СтавкаНДС.Пять") Тогда
        Объект.ЦенаСНДС = Цена * 1.05;
	ИначеЕсли Ставка = ПредопределенноеЗначение("Перечисление.СтавкаНДС.Семь") Тогда
        Объект.ЦенаСНДС = Цена * 1.07;
    ИначеЕсли Ставка = ПредопределенноеЗначение("Перечисление.СтавкаНДС.Десять") Тогда
        Объект.ЦенаСНДС = Цена * 1.10;
    ИначеЕсли Ставка = ПредопределенноеЗначение("Перечисление.СтавкаНДС.ДвадцатьДва") Тогда
        Объект.ЦенаСНДС = Цена * 1.22; 

    КонецЕсли;
    
    Если Объект.ЦенаСНДС = Неопределено Тогда
        Объект.ЦенаСНДС = 0;
	КонецЕсли;
	
КонецПроцедуры
